[{"Title": "About the Department", 
"Data":"The Department of Computer Applications at SRM Institute of Science and Technology has always been on the top as the paradigm of quality with the most modern curriculum and syllabus. Ever since its inception in 2005, the department has attained unprecedented heights and stands on par excellence among its counterparts in Tamil Nadu and India. The Department has proven its academic prowess and success with an extensive range of courses offered both at the Undergraduate and Postgraduate levels. The Department offers BCA, BCA Data Science at the UG level, and MCA, M.Sc Applied Data Science at the PG level. Consistently ranked among the top Computer Applications programs in India, the Computer Applications Department at SRM offers a flexible curriculum designed to allow students to explore their own interests in increasing depth. The curriculum is revamped to suit the industry needs with an emphasis on theory and application that demarcates SRM Computer Applications from most colleges."}, 

{"Title": "Programs Offered", 
"Data":"The Department of Computer Applications offers undergraduate programmes based on world-class syllabus. The curriculum helps students to explore the field of Computer applications and Data Science. It also helps students to identify their skills and enhance their knowledge with creativity. The Computer Applications program focuses on the development of software and applications, computer programming, database management, and web development. The Department of Computer Applications offers postgraduate programmes including core courses as well as elective independent study. It provides latitude for the students to explore the new technology. The syllabus is designed with the metrics of research as it helps students to enhance themselves with the knowledge of incorporating methodology, exploration, and interpretation in the field of research. The Ph.D. program in the Department of Computer Applications has been specially designed to cater to the scholarly needs. The department gives privilege to the research scholars to do their research in their respective domains.  The research supervisors empower the research scholars to do authentic research work. The institution supports the research endeavors of faculty and students by providing incentives for publications and patents. "},

 {"Title":"Welcome message",
  "Data":"The Department of Computer Applications is dedicated for ensuring great careers for students joined for pursuing Undergraduate or Postgraduate. The excellent infrastructure, teaching faculty of the best kind of the Department ensuring quality education such as interaction among students, parents, and staff, along with a Training and Placement Cell ensures a bright future to its students. We strongly encourage innovation in research, in teaching, and in service to the profession, the local community, and industry. Our faculty and students are constantly striving to excel and to advance the state of the art in Computer Applications. The primary focus of our curriculum is to impart technical knowledge, promote problem solving skills, and innovation of new technologies. The department offers a wide variety of elective courses for providing wide spectrum of options to the students to pursue their interests. The course contents are periodically updated for introducing new scientific and technological developments.Undergraduate and Postgraduate students are encouraged to undertake various research projects. We provide ample opportunities to learn more about Computer Applications as a student; we love to share our passion with every student. Learn how to not only use computational tools but how to work in teams, share ideas, present, communicate in short, join creative teams that make a positive difference. We believe that our approach to teaching-learning, coupled with practical experience gained during Industrial Training in reputed organizations, equips our students to handle the challenges posed by the software industry. We look forward to continue to offer our students a greater learning experience in the field of Computer Applications and welcome prospective students to join us and become ambassadors of Computer Applications."}, 

{"Title":"Vision Mission", 
"Data": "To be a leading department that provides transformative education through qualitative teaching and learning practices. To be a centre of excellence in education and research, producing global leaders for improvement of the society To provide sound fundamentals, and advances in Computer Applications by offering world class curricula.To create ethically strong leaders and trend setters for next generation IT.To nurture the desire among faculty and students from across the globe to perform outstanding and impactful research for the benefit of humanity and, to achieve meritorious and significant growth To provide sound fundamentals, and advances in Computer Applications by offering world class curricula. To create ethically strong leaders and trend setters for next generation IT. To nurture the desire among faculty and students from across the globe to perform outstanding and impactful research for the benefit of humanity and, to achieve meritorious and significant growth"}, 

{"Title": "Infrastructure", 
"Data": "Teaching environment and quality are central to SRMIST's capabilities profile. Our Professors are the reason for our continued ability to foster vibrant and value adding learning experiences for our students. The success of our students in terms of their learning and overall development enabled by our faculty members is an area of focus of Leadership at SRMIST. Many opportunities are provided to our faculty members to conduct research and engage with the industry in consultancy and other projects. This platform brings to our faculty members an opportunity to expand their knowledge contribution as well as bring those rich experiential inputs to the classrooms and labs, therefore, benefiting our students."}, 

{"Title":"About LiveWires", 
"Data":"SRM INSTITUTE OF SCIENCE AND TECHNOLOGY, KTR COLLEGE OF SCIENCE AND HUMANITIES DEPARTMENT OF COMPUTER APPLICATIONS About Our Department The Department of Computer Applications at SRM Institute of Science and Technology has been imparting instruction in computer applications with the most modern curriculum and syllabus to students of the post-graduate course since 2005. It has succeeded in creating its own place of excellence among its counterparts in Tamil Nadu and India. Consistently ranked among the top Computer Applications programs in India, The Computer pplications Dept at SRM offers a flexible curriculum designed to allow students to explore their own interests in increasing depth. The Department has a strong commitment to excellence in undergraduate education. The curriculum is revamped to suit the industry needs, emphasizing theory and application that distinguishes SRM-BCA from most colleges. Being one of the largest Departments in the College of Science and Humanities, it has over 1000 students and 18 highly qualified and dedicated staff members. Our faculty, students, staff, and alumni are central to our success as one of the most thriving and Vibrant departments in SRM. Our close ties to industry, coupled with our commitment to research and education, ensure that students get a rigorous, relevant, and broad education. Our world-class laboratory enables the students to be in close proximity to the latest and coolest technologies. It also enlivens our curriculum, provides many research and summer job opportunities for our students, and makes this a very exciting place to study Computer Applications. Programs Offered  BCA - 3 Years UG course on Computer Applications  MCA - 2 Years PG Course on Computer Applications BCA Data Science - 3 years Honors course on Data Science Specialization in collab with DeepSphere.ai M.Sc Applied Data Science - 2 years Masters with specialization in Data Science About LiveWires_  (Programmers Club) Objective: The LiveWires club was started in 2021 to garner the students who love programming. Mission Our mission is to learn and teach (aspiring) Developers and to inspire more students to be programmatically proficient. Vision Our vision is giving our club members a wider view of how the ever-changing world of software engineering works; and how we can keep progressing with it. Club Activities  To involve students in developing novel and innovative in-house projects. Developing Websites, Gaming Applications and Mobile Apps.  Taking trips to hackathons for the  Coding community to get together, pitch ideas and materialize the ideas into apps. Conducting Hackathons and Coding Contests every month for the Ambitious developers  Code Reviews, Discussions and Brain Storming for sharing ideas Involving students in Competitive Programming  Conducting webinars and seminars on recent topics by industry experts. Annual AI Project Expo  Technical Quiz to profitable engage the students LiveWires_ Our Short Journey Completed Projects: -> LiveWires_ Club website development -> International Conference Website for the Department. ->SeatFinder Application for SRM IST Examinations ->Question Paper Automation System Ongoing Projects -> Revamping the LiveWires_ Website Development -> Gearing up for Intellithon 2.0 , an AI Project Expo -> Project Tracking and Management  (ProTrack) -> Reception Bot for the College of Science and Humanities Webinars Conducted for Learning Community 1. Software Development Best Practices - Mr.Suliaman, Cloud Integration Consultant, Ipswich, UK 2. Starter kit for Git and GitHub, Technical Leads, LiveWires_ club 3. Android Application Development, Mr. TamilKanniyan, App Dev - Team Lead 4. Getting Started with Dockers and Kuberneted, Devops Consusltant Mr. Faisal Chisthi at BT 5. Nourishing the Cyber Security Enthisiasts, Mr.Renganathan, Ethical Hacker and a Security Researcher 6. Computers in Automotive Landscape, Mr.Jesu Godwin Devaraj, Assistant Professor, Department of Automobile Engineering, SRM IST 7. Networking, Linux and Bash- Mr.Yuvank Soni, LiveWires_ Club Technical Core This is just our Early Innings, We will race ahead soon!"},

 {"Title": "About BCA Bachelor of Computer Applications Program", 
 "Data": "BCA or Bachelor of Computer Applications is a 3-year undergraduate program that provides students with a strong foundation in computer science and applications. The program focuses on the development of software and applications, computer programming, database management, and web development. Students will also learn about computer networks, operating systems, and information security. Graduates of the program can pursue further studies in computer science, information technology, or related fields, or they can find employment in industries such as software development, e-commerce, IT consulting, and technology support. Other career opportunities include work in research and development, project management, and teaching.Future career prospects: Web Developer Database Administrator Software Developer Computer Programmer"}, 
 
 {"Title": "BCA Bachelor of Computer Applications Eligibility", 
 "Data": "A pass in 10 + 2 (Higher Secondary) with a minimum aggregate of 50% (or) A pass in Diploma in Engineering (10+3 or 10+2+2 Pattern) from a recognised government or competent authority with a minimum aggregate of 50%. Mandatory subjects Atleast one of Mathematics / Business Mathematics / Statistics / Allied Mathematics."}, 
 
 {"Title": "About B.C.A Bachelor of Data Science Program", 
 "Data": "The Bachelor of Computer Applications in Data Science (BCA-Data Science) is a 3-year undergraduate program that focuses on data science, machine learning, and artificial intelligence. The program provides students with a strong foundation in computer science, statistics, and mathematics, and teaches them how to apply these principles to solve real-world problems using data-driven approaches. Graduates of the program can pursue further studies in data science, machine learning, artificial intelligence, or related fields, or they can find employment in industries such as finance, healthcare, marketing, and technology. Other career opportunities include work in research and development, project management, and teaching.Future career prospects: System Engineer Computer Systems Analyst System Administrator/ IT Administrator Computer Scientist"}, 
 
 {"Title": "Eligibility B.C.A Bachelor of Data Science Program ", 
 "Data": "A pass in 10 + 2 (Higher Secondary) with a minimum aggregate of 50% (or) A pass in Diploma in Engineering (10+3 or 10+2+2 Pattern) from a recognised government or competent authority with a minimum aggregate of 50%. Mandatory subjects Atleast one of Mathematics / Business Mathematics / Statistics / Allied Mathematics."}, 
 
 {"Title": "Admission in Department of Computer Applications", 
 "Data": "If you are seeking information regarding admission to the Department of Computer Applications at SRM Institute of Science and Technology (SRMIST), located in SRM Nagar, Kattankulathur, Chengalpattu District, Tamil Nadu, you can reach out to us through the provided contact details. You can either call us at 044-27455756 Extension 4071 or send us an email at hod.dca.ktr@srmist.edu.in. We are here to assist you with any inquiries you may have about the admission process, requirements, programs offered, or any other related information. Feel free to get in touch with us, and we will be happy to help you embark on your academic journey at SRMIST."}, 
 
 
 {"Title": "About M.C.A Master of Computer Applications", 
 "Data": "Master of Computer Applications (M.C.A.) is a postgraduate degree program that focuses on computer science and the practical application of computer technology. M.C.A. programs are designed to equip students with advanced knowledge and skills in various aspects of computer science, software development, and IT management.Future career prospectus: Web Developer Database Administrator Software Developer Computer Programmer"}, 
 
 {"Title": "M.C.A Master of Computer Applications Eligibility", 
 "Data": "a) A pass in B.C.A / B.Sc. in Computer Science / B.Sc. in Information Technology / B.Sc in Computer Technology / Bachelor Degree in Computer Science Engineering or equivalent Degree from a University recognized / certified by UGC / SRMIST / AIU (or) b) A pass in B.Sc. / B.Com. / B.A. from University recognized/certified by UGC / SRMIST / AIU with Mathematics at 10+2 Level or at Graduation Level. c) A minimum aggregate of 60% in UG. d ) Notwithstanding the above, actual Admissions will also be based on the rules and regulations of the UGC / AICTE / Competent authorities."}, 
 
 {"Title": "About Master of Science in Applied Data Science ", 
 "Data": "Master of Science in Applied Data Science is a 2 year degree program is designed to train professionals who can manage and manipulate potentially complex datasets; analyse their content; and effectively communicate these analyses results and significance to managers and other decision-making personnel. This course provides you with advanced knowledge, methods and processes as an enabler for deploying data science and artificial intelligence."}, 
 
 {"Title": "MSC.ADS Master of Science in Applied Data ScienceEligibility  ",
  "Data": "A pass in B.Sc. Computer Science (or) B.Sc. (IT) (or) BCA (or) B.Sc. Mathematics (or) B.Sc. Statistics (or) B.Sc. Physics (or) B.Sc. Electronics (or) B.Sc. Triple Major with Computer Science as one of the major subjects.A minimum aggregate of 50% in UG."}]
